import React from "react";
import {
  StyledDescr,
  StyledList,
  StyledListItem,
  StyledListTitle,
  StyledSubTitle,
  StyledTitle,
} from "./Home.styled";
import Container from "../../components/Container/Container";

const Home = () => {
  return (
    <>
      <Container>
        <StyledTitle>
          Ласкаво просимо в <span>AutoRent</span>
        </StyledTitle>
        <StyledSubTitle>
          – вашому надійному партнерові у світі мобільності в Україні!
        </StyledSubTitle>
        <StyledDescr>
          Ми - професійна компанія, що спеціалізується на оренді автомобілів,
          <br />
          пропонуючи розширений асортимент транспортних засобів для ваших
          потреб.
        </StyledDescr>
        <StyledListTitle>Наші переваги:</StyledListTitle>
        <StyledList>
          <StyledListItem>
            <h3>Широкий вибір автомобілів</h3>
            <p>
              Ви можете обрати ідеальний автомобіль для своїх подорожей серед
              нашого різноманітного парку, включаючи економічні моделі,
              комфортні седани, просторі кросовери та елітні представницькі
              авто.
            </p>
          </StyledListItem>
          <StyledListItem>
            <h3>Гнучка система оренди</h3>
            <p>
              Наша компанія пропонує різні терміни оренди, включаючи
              короткострокову та довгострокову оренду. Ми прагнемо надати вам
              максимальний комфорт і забезпечити ваші індивідуальні потреби.
            </p>
          </StyledListItem>
          <StyledListItem>
            <h3>Чесні та прозорі умови</h3>
            <p>
              Наші тарифи включають в себе всі необхідні витрати, без прихованих
              платежів. Ви можете бути впевнені, що ціна, яку ви бачите, - це
              ціна, яку ви платите.
            </p>
          </StyledListItem>
          <StyledListItem>
            <h3>Обслуговування високого рівня</h3>
            <p>
              Команда наших професіоналів завжди готова надати вам відмінний
              сервіс. Ми віримо в індивідуальний підхід до кожного клієнта та
              робимо все можливе для вашого комфорту.
            </p>
          </StyledListItem>
          <StyledListItem>
            <h3>Безпека та надійність</h3>
            <p>
              Всі наші автомобілі проходять регулярні технічні огляди та
              обслуговування, щоб гарантувати вашу безпеку на дорозі.
            </p>
          </StyledListItem>
        </StyledList>
        <StyledDescr>
          Нехай ваша подорож стане незабутньою з <span>AutoRent</span>.<br />
          Забронюйте свій автомобіль вже сьогодні та відчуйте вільність руху
          разом з нами!
        </StyledDescr>
      </Container>
    </>
  );
};

export default Home;
