import React from "react";
import {
  StyledDescr,
  StyledList,
  StyledSubTitle,
  StyledTitle,
} from "./Home.styled";
import Container from "../../components/Container/Container";

const Home = () => {
  return (
    <>
      <Container>
        <StyledTitle>
          Ласкаво просимо в <span>AutoRent</span>
        </StyledTitle>
        <StyledSubTitle>
          – вашому надійному партнерові у світі мобільності в Україні!
        </StyledSubTitle>
        <StyledDescr>
          Ми - професійна компанія, що спеціалізується на оренді автомобілів,
          <br />
          пропонуючи розширений асортимент транспортних засобів для ваших
          потреб.
        </StyledDescr>
        <h2>Наші переваги:</h2>
        <StyledList>
          <li>
            <p>
              <span>Широкий вибір автомобілів</span> <br /> Ви можете обрати
              ідеальний автомобіль для своїх подорожей серед нашого
              різноманітного парку, включаючи економічні моделі, комфортні
              седани, просторі кросовери та елітні представницькі авто.
            </p>
          </li>
          <li>
            <p>
              <span>Гнучка система оренди</span> <br /> Наша компанія пропонує
              різні терміни оренди, включаючи короткострокову та довгострокову
              оренду. Ми прагнемо надати вам максимальний комфорт і забезпечити
              ваші індивідуальні потреби.
            </p>
          </li>
          <li>
            <p>
              <span>Чесні та прозорі умови</span> <br /> Наші тарифи включають в
              себе всі необхідні витрати, без прихованих платежів. Ви можете
              бути впевнені, що ціна, яку ви бачите, - це ціна, яку ви платите.
            </p>
          </li>
          <li>
            <p>
              <span>Обслуговування високого рівня</span> <br /> Команда наших
              професіоналів завжди готова надати вам відмінний сервіс. Ми віримо
              в індивідуальний підхід до кожного клієнта та робимо все можливе
              для вашого комфорту.
            </p>
          </li>
          <li>
            <p>
              <span>Безпека та надійність</span> <br /> Всі наші автомобілі
              проходять регулярні технічні огляди та обслуговування, щоб
              гарантувати вашу безпеку на дорозі.
            </p>
          </li>
        </StyledList>
        <StyledDescr>
          Нехай ваша подорож стане незабутньою з AutoRent.
          <br />
          Забронюйте свій автомобіль вже сьогодні та відчуйте вільність руху
          разом з нами!
        </StyledDescr>
      </Container>
    </>
  );
};

export default Home;
